#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```hcl

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/alliebarnett44/running-shoe-tracker/runs/run-gf2bwhjQsST1Zg6g

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=b5f57affa12151d47b90dbe424badc533b818529]
aws_iam_role.lambda_role: Refreshing state... [id=running-shoe-tracker-lambda-role]
aws_api_gateway_rest_api.api: Refreshing state... [id=w0y4datx2d]
aws_dynamodb_table.running_shoe_tracker: Refreshing state... [id=running-shoe-tracker]
aws_iam_role_policy.lambda_policy: Refreshing state... [id=running-shoe-tracker-lambda-role:lambda_write_policy]
aws_lambda_function.running_shoe_tracker: Refreshing state... [id=running-shoe-tracker]
aws_lambda_permission.running_shoe_tracker: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.apideploy: Refreshing state... [id=vsx1lr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.proxy_integration will be created
  + resource "aws_api_gateway_integration" "proxy_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "w0y4datx2d"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:406869697034:function:running-shoe-tracker/invocations"
    }

  # aws_api_gateway_method.post will be created
  + resource "aws_api_gateway_method" "post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "w0y4datx2d"
    }

  # aws_api_gateway_resource.api will be created
  + resource "aws_api_gateway_resource" "api" {
      + id          = (known after apply)
      + parent_id   = "jch4s3hlxf"
      + path        = (known after apply)
      + path_part   = "api"
      + rest_api_id = "w0y4datx2d"
    }

  # aws_lambda_function.running_shoe_tracker will be updated in-place
  ~ resource "aws_lambda_function" "running_shoe_tracker" {
      ~ handler                        = "index.handler" -> "lambda_function.lambda_handler"
        id                             = "running-shoe-tracker"
      ~ role                           = "arn:aws:iam::406869697034:role/service-role/running-shoe-tracker-final" -> "arn:aws:iam::406869697034:role/running-shoe-tracker-lambda-role"
      ~ runtime                        = "nodejs16.x" -> "python3.9"
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.running_shoe_tracker will be created
  + resource "aws_lambda_permission" "running_shoe_tracker" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "running-shoe-tracker"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:406869697034:w0y4datx2d/prod/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.


```
</details>

*Pusher: @alliebarnett44, Action: `pull_request`*